In [3]:
# ! pip install pandas

In [6]:
import numpy as np
import pandas as pd

#### Series

In [10]:
countries = ['US', "India", 'Spain', 'Germany', "Russia"]

In [11]:
countries

['US', 'India', 'Spain', 'Germany', 'Russia']

In [13]:
countries = pd.Series(countries)
countries

0         US
1      India
2      Spain
3    Germany
4     Russia
dtype: object

In [14]:
type(countries)

pandas.core.series.Series

In [17]:
countries[2]

'Spain'

In [18]:
countries.index = ['a', 'b', 'c', 'd', 'e']

In [19]:
countries

a         US
b      India
c      Spain
d    Germany
e     Russia
dtype: object

In [22]:
countries['c']

'Spain'

### DataFrame (Most Imp.)

In [25]:
arr = np.random.randint(10, 100, size=(5,4))
arr

array([[81, 13, 11, 52],
       [28, 94, 83, 13],
       [80, 94, 76, 28],
       [34, 67, 21, 83],
       [99, 99, 53, 41]])

In [28]:
df = pd.DataFrame(data = arr, columns=['Height', 'Weight', 'BMI', 'Age'])
df

   Height  Weight  BMI  Age
0      81      13   11   52
1      28      94   83   13
2      80      94   76   28
3      34      67   21   83
4      99      99   53   41

In [29]:
df.columns

Index(['Height', 'Weight', 'BMI', 'Age'], dtype='object')

In [30]:
type(df)

pandas.core.frame.DataFrame

In [31]:
df['Height']

0    81
1    28
2    80
3    34
4    99
Name: Height, dtype: int64

### Reading Our Dataset

In [34]:
data = pd.read_csv('UberData.csv')

In [35]:
type(data)

pandas.core.frame.DataFrame

In [36]:
data.shape

(1156, 7)

In [38]:
# what are column names
data.columns

Index(['START_DATE*', 'END_DATE*', 'CATEGORY*', 'START*', 'STOP*', 'MILES*',
       'PURPOSE*'],
      dtype='object')

In [44]:
data.head(n=3)

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies

In [41]:
data.tail()

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
1151,12/31/2016 13:24,12/31/2016 13:42,Business,Kar?chi,Unknown Location,3.9,Temporary Site
1152,12/31/2016 15:03,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting
1153,12/31/2016 21:32,12/31/2016 21:50,Business,Katunayake,Gampaha,6.4,Temporary Site
1154,12/31/2016 22:08,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site
1155,Totals,NaN,NaN,NaN,NaN,12204.7,NaN

In [48]:
# drop the row having index = 1155

#data = data.drop(index=1155)

data.drop(index = 1155, inplace = True)

In [50]:
data.tail()

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
1150,12/31/2016 1:07,12/31/2016 1:14,Business,Kar?chi,Kar?chi,0.7,Meeting
1151,12/31/2016 13:24,12/31/2016 13:42,Business,Kar?chi,Unknown Location,3.9,Temporary Site
1152,12/31/2016 15:03,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting
1153,12/31/2016 21:32,12/31/2016 21:50,Business,Katunayake,Gampaha,6.4,Temporary Site
1154,12/31/2016 22:08,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site

In [51]:
data.shape

(1155, 7)

In [52]:
data.dtypes

START_DATE*     object
END_DATE*       object
CATEGORY*       object
START*          object
STOP*           object
MILES*         float64
PURPOSE*        object
dtype: object

In [53]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1155 entries, 0 to 1154
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   START_DATE*  1155 non-null   object
 1   END_DATE*    1155 non-null   object
 2   CATEGORY*    1155 non-null   object
 3   START*       1155 non-null   object
 4   STOP*        1155 non-null   object
 5   MILES*       1155 non-null   float64
 6   PURPOSE*     653 non-null    object
dtypes: float64(1), object(6)
memory usage: 72.2+ KB

In [54]:
data.head()

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,1/5/2016 17:31,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit

In [55]:
data.columns

Index(['START_DATE*', 'END_DATE*', 'CATEGORY*', 'START*', 'STOP*', 'MILES*',
       'PURPOSE*'],
      dtype='object')

In [59]:
data.columns = [col[:-1] for col in data.columns]

In [81]:
data.head()

,START_DATE,END_DATE,CATEGORY,START,STOP,MILES,PURPOSE
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,1/5/2016 17:31,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit

In [83]:
data['MILES']

0        5.1
1        5.0
2        4.8
3        4.7
4       63.7
        ...
1150     0.7
1151     3.9
1152    16.2
1153     6.4
1154    48.2
Name: MILES, Length: 1155, dtype: float64

In [84]:
cols = ['PURPOSE', 'MILES']

In [86]:
data[cols].head()

           PURPOSE  MILES
0   Meal/Entertain    5.1
1              NaN    5.0
2  Errand/Supplies    4.8
3          Meeting    4.7
4   Customer Visit   63.7

## Feature Engineering

In [87]:
data.head()

,START_DATE,END_DATE,CATEGORY,START,STOP,MILES,PURPOSE
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,1/5/2016 17:31,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit

In [95]:
data['START_DATE'] =  pd.to_datetime(data['START_DATE'])
data['END_DATE'] =  pd.to_datetime(data['END_DATE'])

In [96]:
data.dtypes

START_DATE    datetime64[ns]
END_DATE      datetime64[ns]
CATEGORY              object
START                 object
STOP                  object
MILES                float64
PURPOSE               object
dtype: object

In [100]:
date = data['START_DATE'][0]
date

Timestamp('2016-01-01 21:11:00')

In [110]:
print(date.year)
print(date.month)
print(date.month_name())
print(date.day)
print(date.day_name())
print(date.dayofweek)
print(date.hour)

2016
1
January
1
Friday
4
21

In [117]:
year = []
month = []
month_name = []
day = []
day_name = []
dayofweek = []
hour = []

In [118]:
for date in data['START_DATE']:
    year.append(date.year)
    month.append(date.month)
    month_name.append(date.month_name())
    day.append(date.day)
    day_name.append(date.day_name())
    dayofweek.append(date.dayofweek)
    hour.append(date.hour)

In [132]:
# creating new columns

data['YEAR'] = year
data['MONTH'] = month
data['MONTH_NAME'] = month_name
data['DAY'] = day
data['DAYNAME'] = day_name
data['DAYOFWEEK'] = dayofweek
data['HOUR'] = hour

In [133]:
data.head()

,START_DATE,END_DATE,CATEGORY,START,STOP,MILES,PURPOSE,HOUR,YEAR,MONTH,MONTH_NAME,DAY,DAYNAME,DAYOFWEEK
0,2016-01-01 21:11:00,2016-01-01 21:17:00,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain,21,2016,1,January,1,Friday,4
1,2016-01-02 01:25:00,2016-01-02 01:37:00,Business,Fort Pierce,Fort Pierce,5.0,NaN,1,2016,1,January,2,Saturday,5
2,2016-01-02 20:25:00,2016-01-02 20:38:00,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies,20,2016,1,January,2,Saturday,5
3,2016-01-05 17:31:00,2016-01-05 17:45:00,Business,Fort Pierce,Fort Pierce,4.7,Meeting,17,2016,1,January,5,Tuesday,1
4,2016-01-06 14:42:00,2016-01-06 15:49:00,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit,14,2016,1,January,6,Wednesday,2

### Extracting data

In [135]:
data['MONTH_NAME'].head()

0    January
1    January
2    January
3    January
4    January
Name: MONTH_NAME, dtype: object

## Extracting rows
- loc
- iloc

In [137]:
data.head()

,START_DATE,END_DATE,CATEGORY,START,STOP,MILES,PURPOSE,HOUR,YEAR,MONTH,MONTH_NAME,DAY,DAYNAME,DAYOFWEEK
0,2016-01-01 21:11:00,2016-01-01 21:17:00,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain,21,2016,1,January,1,Friday,4
1,2016-01-02 01:25:00,2016-01-02 01:37:00,Business,Fort Pierce,Fort Pierce,5.0,NaN,1,2016,1,January,2,Saturday,5
2,2016-01-02 20:25:00,2016-01-02 20:38:00,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies,20,2016,1,January,2,Saturday,5
3,2016-01-05 17:31:00,2016-01-05 17:45:00,Business,Fort Pierce,Fort Pierce,4.7,Meeting,17,2016,1,January,5,Tuesday,1
4,2016-01-06 14:42:00,2016-01-06 15:49:00,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit,14,2016,1,January,6,Wednesday,2

In [143]:
data.loc[1]

START_DATE    2016-01-02 01:25:00
END_DATE      2016-01-02 01:37:00
CATEGORY                 Business
START                 Fort Pierce
STOP                  Fort Pierce
MILES                         5.0
PURPOSE                       NaN
HOUR                            1
YEAR                         2016
MONTH                           1
MONTH_NAME                January
DAY                             2
DAYNAME                  Saturday
DAYOFWEEK                       5
Name: 1, dtype: object

In [146]:
# extract 2nd row, i
data.iloc[1]

START_DATE    2016-01-02 01:25:00
END_DATE      2016-01-02 01:37:00
CATEGORY                 Business
START                 Fort Pierce
STOP                  Fort Pierce
MILES                         5.0
PURPOSE                       NaN
HOUR                            1
YEAR                         2016
MONTH                           1
MONTH_NAME                January
DAY                             2
DAYNAME                  Saturday
DAYOFWEEK                       5
Name: 1, dtype: object

In [148]:
data.iloc[3:10, 2:5]

   CATEGORY            START             STOP
3  Business      Fort Pierce      Fort Pierce
4  Business      Fort Pierce  West Palm Beach
5  Business  West Palm Beach  West Palm Beach
6  Business  West Palm Beach       Palm Beach
7  Business             Cary             Cary
8  Business             Cary      Morrisville
9  Business          Jamaica         New York

In [152]:
data.loc[ 3:10, 'CATEGORY' : 'STOP' ]

    CATEGORY            START             STOP
3   Business      Fort Pierce      Fort Pierce
4   Business      Fort Pierce  West Palm Beach
5   Business  West Palm Beach  West Palm Beach
6   Business  West Palm Beach       Palm Beach
7   Business             Cary             Cary
8   Business             Cary      Morrisville
9   Business          Jamaica         New York
10  Business         New York           Queens

In [171]:
data.iloc[[10,1000]]

,START_DATE,END_DATE,CATEGORY,START,STOP,MILES,PURPOSE,HOUR,YEAR,MONTH,MONTH_NAME,DAY,DAYNAME,DAYOFWEEK
10,2016-01-10 15:08:00,2016-01-10 15:51:00,Business,New York,Queens,10.8,Meeting,15,2016,1,January,10,Sunday,6
1000,2016-11-26 17:00:00,2016-11-26 17:12:00,Business,Cary,Apex,5.1,Meeting,17,2016,11,November,26,Saturday,5

In [172]:
data.iloc[3:10, [0, -1] ]

           START_DATE  DAYOFWEEK
3 2016-01-05 17:31:00          1
4 2016-01-06 14:42:00          2
5 2016-01-06 17:15:00          2
6 2016-01-06 17:30:00          2
7 2016-01-07 13:27:00          3
8 2016-01-10 08:05:00          6
9 2016-01-10 12:17:00          6